In [1]:
import numpy as np
import pandas as pd

In [2]:
custd = pd.read_excel(r"C:\Users\seyi\Desktop\My Internship Work\KPMG INTERNSHIP\customer demographic.xlsx")

In [3]:
custd.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,<script>alert('hi')</script>,Yes,16.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,2018-02-01 00:00:00,Yes,15.0
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,() { _; } >_[$($())] { touch /tmp/blns.shellsh...,No,7.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,NIL,Yes,8.0

In [4]:
custd.shape

(4000, 13)

In [6]:
custd.describe()

       customer_id  past_3_years_bike_related_purchases       tenure
count  4000.000000                          4000.000000  3913.000000
mean   2000.500000                            48.890000    10.657041
std    1154.844867                            28.715005     5.660146
min       1.000000                             0.000000     1.000000
25%    1000.750000                            24.000000     6.000000
50%    2000.500000                            48.000000    11.000000
75%    3000.250000                            73.000000    15.000000
max    4000.000000                            99.000000    22.000000

In [7]:
custd.isnull().sum()

customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
default                                302
owns_car                                 0
tenure                                  87
dtype: int64

In [8]:
custd['last_name'].value_counts()

Pristnor      3
Ramsdell      3
O'Halloran    2
Mowday        2
Beefon        2
             ..
Merali        1
Drinnan       1
Mowles        1
Parkyn        1
Morville      1
Name: last_name, Length: 3725, dtype: int64

In [9]:
custd['last_name']=custd['last_name'].fillna(method='ffill')

In [10]:
custd['DOB'].value_counts()

1978-01-30    7
1977-05-13    4
1976-07-16    4
1978-08-19    4
1976-09-25    4
             ..
1974-06-16    1
1969-11-21    1
1961-11-24    1
1995-05-03    1
1972-04-14    1
Name: DOB, Length: 3448, dtype: int64

In [12]:
custd['DOB']=custd['DOB'].fillna(method='ffill')

In [14]:
custd['job_title'].value_counts()

Business Systems Development Analyst    45
Social Worker                           44
Tax Accountant                          44
Internal Auditor                        42
Legal Assistant                         41
                                        ..
Computer Systems Analyst III             4
Health Coach I                           3
Research Assistant III                   3
Health Coach III                         3
Developer I                              1
Name: job_title, Length: 195, dtype: int64

In [15]:
custd['job_title']=custd['job_title'].fillna(method='ffill')

In [16]:
custd['job_industry_category'].value_counts()

Manufacturing         799
Financial Services    774
Health                602
Retail                358
Property              267
IT                    223
Entertainment         136
Argiculture           113
Telecommunications     72
Name: job_industry_category, dtype: int64

In [17]:
custd['job_industry_category']=custd['job_industry_category'].fillna(method='ffill')

In [18]:
del custd['default']

In [19]:
custd['tenure'].mean()

10.65704063378482

In [20]:
custd['tenure']=custd['tenure'].fillna(method='ffill')

In [21]:
submission = pd.DataFrame({
        "customer_id": custd["customer_id"],
        "first_name": custd["first_name"],
        "last_name": custd["last_name"],
        "gender": custd["gender"],
        "past_3_years_bike_related_purchases": custd["past_3_years_bike_related_purchases"],
        "DOB": custd["DOB"],
        "job_title": custd["job_title"],
        "job_industry_category": custd["job_industry_category"],
        "wealth_segment": custd["wealth_segment"],
        "deceased_indicator": custd["deceased_indicator"],
        "owns_car": custd["owns_car"],
        "tenure": custd["tenure"]
    })
submission.to_csv('./submission.csv', index=False)

In [22]:
submission.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,11.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,15.0
3,4,Talbot,Dearle,Male,33,1961-10-03,Recruiting Manager,IT,Mass Customer,N,No,7.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,IT,Affluent Customer,N,Yes,8.0

In [24]:
submission.describe()

       customer_id  past_3_years_bike_related_purchases       tenure
count  4000.000000                          4000.000000  4000.000000
mean   2000.500000                            48.890000    10.665250
std    1154.844867                            28.715005     5.658286
min       1.000000                             0.000000     1.000000
25%    1000.750000                            24.000000     6.000000
50%    2000.500000                            48.000000    11.000000
75%    3000.250000                            73.000000    15.000000
max    4000.000000                            99.000000    22.000000